# 1. BASIC PYTHON DATETIME MODULE

In [1]:
# datetime is one of Python's core standard libraries 
# We are going to use two methods to deal with dates/times: (1) date and (2) dateime
# date: helps us define dates only without including time (month, day, year)
# datetime: helps us define times and dates together (month, day, year, hour, second, microsecond)
# Let's import datetime module as dt
import pandas as pd
import datetime as dt

In [2]:
# Pick a date using Python's date method inside the datetime module
my_date = dt.date(2020, 3, 22)
my_date

datetime.date(2020, 3, 22)

In [3]:
# Check the data type (datetime object)
type(my_date)

datetime.date

In [4]:
# Convert it into string to view the date and time
str(my_date)

'2020-03-22'

In [5]:
# Attribute day will return the day contained in the datetime object
my_date.day

22

In [6]:
# Month attribute will return the month contained in the datetime object
my_date.month

3

In [7]:
# year attribute will return the year contained in the datetime object
my_date.year

2020

In [8]:
# Let's define a datetime using datetime method as follows
my_datetime = dt.datetime(2020, 3, 22, 8, 20, 50)

In [10]:
# - Convert it into string to view the date time
str(my_datetime)

'2020-03-22 08:20:50'

In [11]:
# Obtain the hour contained in the datetime object
my_datetime.hour

8

In [12]:
# Obtain the minutes contained in the datetime object
my_datetime.minute

20

In [13]:
# print out calendar!
import calendar
print(calendar.month(2021, 3))

     March 2021
Mo Tu We Th Fr Sa Su
 1  2  3  4  5  6  7
 8  9 10 11 12 13 14
15 16 17 18 19 20 21
22 23 24 25 26 27 28
29 30 31

In [14]:
# You can also use pd.datetime to convert a regular Pandas Series into datetime as follows:
dates = pd.Series(['2020/03/22', '2020-08-25', 'March 22nd 2020'])
dates

0         2020/03/22
1         2020-08-25
2    March 22nd 2020
dtype: object

In [15]:
# The to_datetime() method converts the date and time in string format to a DateTime object:
my_dates = pd.to_datetime(dates)
my_dates

0   2020-03-22
1   2020-08-25
2   2020-03-22
dtype: datetime64[ns]

**MINI CHALLENGE #1:**
- **Use Python's datetime method to write your date and time of your birth! Convert it into string format**

In [16]:
import datetime as dt
my_birth = dt.datetime(1992, 10, 25, 8, 9, 20)
str(my_birth)

'1992-10-25 08:09:20'

# 2. HANDLING DATES AND TIMES USING PANDAS

In [2]:
# Timestamp is the pandas equivalent of python’s Datetime and is interchangeable with it in most cases. 
# It’s the type used for the entries that make up a DatetimeIndex, and other timeseries oriented data structures in pandas.
# Check this out: https://pandas.pydata.org/docs/reference/api/pandas.Timestamp.html
pd.Timestamp('2020-3-22')

Timestamp('2020-03-22 00:00:00')

In [3]:
pd.Timestamp('2020, 3, 22, 10')

Timestamp('2020-03-22 10:00:00')

In [4]:
# Or you can define a Pandas Timestamp using Python datetime object 
pd.Timestamp(dt.datetime(2020, 3, 22, 8, 20, 50))

Timestamp('2020-03-22 08:20:50')

In [5]:
# Calculate difference between two dates
day_1 = pd.Timestamp('1998, 3, 22, 10')
day_2 = pd.Timestamp('2021, 3, 22, 10')
delta = day_2 - day_1
print(delta)

8401 days 00:00:00

In [6]:
# Let's define 3 dates for 3 separate transactions
date_1 = dt.date(2020, 3, 22)
date_2 = dt.date(2020, 4, 22)
date_3 = dt.date(2020, 5, 22)

In [7]:
# Let's put the 3 dates in a list as follows
dates_list = [date_1, date_2, date_3]

# Use Pandas DateTimeIndex to convert the list into datetime datatype as follows
# Datetime index constructor method creates a collection of dates
dates_index = pd.DatetimeIndex(dates_list)

In [8]:
dates_index

DatetimeIndex(['2020-03-22', '2020-04-22', '2020-05-22'], dtype='datetime64[ns]', freq=None)

In [9]:
# Define a list that carries 3 values corresponding to store sales
sales = [50, 55, 60]

In [10]:
# Define a Pandas Series using datetime and values as follows:
sales = pd.Series(data=sales, index=dates_index)
sales

2020-03-22    50
2020-04-22    55
2020-05-22    60
dtype: int64

In [12]:
# you can also define a range of dates as follows:
my_days = pd.date_range(start='2020-01-01', end='2020-04-01', freq='D')
my_days

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-15', '2020-02-16', '2020-02-17',
               '2020-02-18', '2020-02-19', '2020-02-20', '2020-02-21',
               '2020-02-22', '2020-02-23', '2020-02-24', '2020-02-25',
               '2020-02-26', '2020-02-27', '2020-02-28', '2020-02-29',
               '2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-14', '2020-03-15', '2020-03-16',
               '2020-03-17', '2020-03-18', '2020-03-19', '2020-03-20',
               '2020-03-21', '2020-03-22', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-28',
               '2020-03-29', '2020-03-30', '2020-03-31', '2020-04-01'],
              dtype='datetime64[ns]', freq='D')

In [13]:
# Datatype is a datetimeindex (which is a collection of dates!)
type(my_days)

pandas.core.indexes.datetimes.DatetimeIndex

In [15]:
# If you pick any sample date, it's represented in timestamp datatype
my_days[4]
type(my_days[4])

pandas._libs.tslibs.timestamps.Timestamp

In [16]:
# you can also define a range of dates using M which stands for month end as follows:
my_days = pd.date_range(start='2020-01-01', end='2020-08-01', freq='M')
my_days

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31', '2020-06-30', '2020-07-31'],
              dtype='datetime64[ns]', freq='M')

In [17]:
# Alternative way of defining a list of dates
pd.date_range(start='2020-01-01', periods=20, freq='D')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20'],
              dtype='datetime64[ns]', freq='D')

**MINI CHALLENGE #2:**
- **Obtain the business days between 2020-01-01 and 2020-04-01**

In [18]:
my_days = pd.date_range(start='2020-01-01', end='2020-04-01', freq='B')
my_days

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-20', '2020-01-21', '2020-01-22',
               '2020-01-23', '2020-01-24', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-03',
               '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14', '2020-02-17', '2020-02-18', '2020-02-19',
               '2020-02-20', '2020-02-21', '2020-02-24', '2020-02-25',
               '2020-02-26', '2020-02-27', '2020-02-28', '2020-03-02',
               '2020-03-03', '2020-03-04', '2020-03-05', '2020-03-06',
               '2020-03-09', '2020-03-10', '2020-03-11', '2020-03-12',
               '2020-03-13', '2020-03-16', '2020-03-17', '2020-03-18',
               '2020-03-19', '2020-03-20', '2020-03-23', '2020-03-24',
               '2020-03-25', '2020-03-26', '2020-03-27', '2020-03-30',
               '2020-03-31', '2020-04-01'],
              dtype='datetime64[ns]', freq='B')

# 3. DATETIME IN ACTION! PRACTICAL EXAMPLE PART #1

In [46]:
# dataframes creation for both training and testing datasets 
avocado_df = pd.read_csv('avocado.csv')
avocado_df

# Convert date column to datetime format
avocado_df['Date'] = pd.to_datetime(avocado_df['Date'])
avocado_df

# Date: The date of the observation
# AveragePrice: the average price of a single avocado
# type: conventional or organic
# Region: the city or region of the observation
# Total Volume: Total number of avocados sold

            Date  AveragePrice  Total Volume          type            region
0     2015-12-27          1.33      64236.62  conventional            Albany
1     2015-12-20          1.35      54876.98  conventional            Albany
2     2015-12-13          0.93     118220.22  conventional            Albany
3     2015-12-06          1.08      78992.15  conventional            Albany
4     2015-11-29          1.28      51039.60  conventional            Albany
...          ...           ...           ...           ...               ...
18244 2018-02-04          1.63      17074.83       organic  WestTexNewMexico
18245 2018-01-28          1.71      13888.04       organic  WestTexNewMexico
18246 2018-01-21          1.87      13766.76       organic  WestTexNewMexico
18247 2018-01-14          1.93      16205.22       organic  WestTexNewMexico
18248 2018-01-07          1.62      17489.58       organic  WestTexNewMexico

[18249 rows x 5 columns]

In [21]:
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          18249 non-null  datetime64[ns]
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   type          18249 non-null  object
 4   region        18249 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 713.0+ KB

In [47]:
# You can select any column to be the index for the DataFrame
avocado_df.set_index(keys=['Date'], inplace=True)

In [31]:
avocado_df.head(10)

            AveragePrice  Total Volume          type  region
Date
2015-12-27          1.33      64236.62  conventional  Albany
2015-12-20          1.35      54876.98  conventional  Albany
2015-12-13          0.93     118220.22  conventional  Albany
2015-12-06          1.08      78992.15  conventional  Albany
2015-11-29          1.28      51039.60  conventional  Albany
2015-11-22          1.26      55979.78  conventional  Albany
2015-11-15          0.99      83453.76  conventional  Albany
2015-11-08          0.98     109428.33  conventional  Albany
2015-11-01          1.02      99811.42  conventional  Albany
2015-10-25          1.07      74338.76  conventional  Albany

In [24]:
avocado_df.values

array([[1.33, 64236.62, 'conventional', 'Albany'],
       [1.35, 54876.98, 'conventional', 'Albany'],
       [0.93, 118220.22, 'conventional', 'Albany'],
       ...,
       [1.87, 13766.76, 'organic', 'WestTexNewMexico'],
       [1.93, 16205.22, 'organic', 'WestTexNewMexico'],
       [1.62, 17489.58, 'organic', 'WestTexNewMexico']], dtype=object)

In [25]:
avocado_df.columns

Index(['AveragePrice', 'Total Volume', 'type', 'region'], dtype='object')

In [26]:
avocado_df.index

DatetimeIndex(['2015-12-27', '2015-12-20', '2015-12-13', '2015-12-06',
               '2015-11-29', '2015-11-22', '2015-11-15', '2015-11-08',
               '2015-11-01', '2015-10-25',
               ...
               '2018-03-11', '2018-03-04', '2018-02-25', '2018-02-18',
               '2018-02-11', '2018-02-04', '2018-01-28', '2018-01-21',
               '2018-01-14', '2018-01-07'],
              dtype='datetime64[ns]', name='Date', length=18249, freq=None)

**MINI CHALLENGE #3:**
- **What are the datatypes of each column in the avocado_df DataFrame?**

In [27]:
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 18249 entries, 2015-12-27 to 2018-01-07
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AveragePrice  18249 non-null  float64
 1   Total Volume  18249 non-null  float64
 2   type          18249 non-null  object
 3   region        18249 non-null  object
dtypes: float64(2), object(2)
memory usage: 712.9+ KB

In [28]:
avocado_df = pd.read_csv('avocado.csv')
avocado_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          18249 non-null  object
 1   AveragePrice  18249 non-null  float64
 2   Total Volume  18249 non-null  float64
 3   type          18249 non-null  object
 4   region        18249 non-null  object
dtypes: float64(2), object(3)
memory usage: 713.0+ KB

# 4. DATETIME IN ACTION! PRACTICAL EXAMPLE PART #2

In [44]:
avocado_df.head(10)

        Date  AveragePrice  Total Volume          type  region
0 2015-12-27          1.33      64236.62  conventional  Albany
1 2015-12-20          1.35      54876.98  conventional  Albany
2 2015-12-13          0.93     118220.22  conventional  Albany
3 2015-12-06          1.08      78992.15  conventional  Albany
4 2015-11-29          1.28      51039.60  conventional  Albany
5 2015-11-22          1.26      55979.78  conventional  Albany
6 2015-11-15          0.99      83453.76  conventional  Albany
7 2015-11-08          0.98     109428.33  conventional  Albany
8 2015-11-01          1.02      99811.42  conventional  Albany
9 2015-10-25          1.07      74338.76  conventional  Albany

In [48]:
# access elements with a specific datetime index using .loc
avocado_df.loc['2018-01-21']

            AveragePrice  Total Volume          type               region
Date
2018-01-21          1.69     135196.35  conventional               Albany
2018-01-21          1.10     639421.29  conventional              Atlanta
2018-01-21          1.18    1102213.13  conventional  BaltimoreWashington
2018-01-21          1.25      88727.77  conventional                Boise
2018-01-21          1.12     999783.13  conventional               Boston
...                  ...           ...           ...                  ...
2018-01-21          1.27       3159.80       organic             Syracuse
2018-01-21          1.52       6871.05       organic                Tampa
2018-01-21          1.63    1283987.65       organic              TotalUS
2018-01-21          1.83     189317.99       organic                 West
2018-01-21          1.87      13766.76       organic     WestTexNewMexico

[108 rows x 4 columns]

In [49]:
# You can use iloc if you decide to use numeric indexes
avocado_df.iloc[5]

AveragePrice            1.26
Total Volume        55979.78
type            conventional
region                Albany
Name: 2015-11-22 00:00:00, dtype: object

In [50]:
# Access more than one element within a given date range
avocado_df.loc['2015-01-04':'2015-01-25']

            AveragePrice  Total Volume          type            region
Date
2015-01-25          1.06      45147.50  conventional            Albany
2015-01-18          1.17      44511.28  conventional            Albany
2015-01-11          1.24      41195.08  conventional            Albany
2015-01-04          1.22      40873.28  conventional            Albany
2015-01-25          1.10     449332.85  conventional           Atlanta
...                  ...           ...           ...               ...
2015-01-04          1.40     187548.30       organic              West
2015-01-25          1.63       7324.06       organic  WestTexNewMexico
2015-01-18          1.71       5508.20       organic  WestTexNewMexico
2015-01-11          1.69       6861.73       organic  WestTexNewMexico
2015-01-04          1.64       6182.81       organic  WestTexNewMexico

[432 rows x 4 columns]

In [51]:
# Truncate a sorted DataFrame given index bounds.
# Make sure to sort the dataframe before applying truncate 
avocado_df.sort_index(inplace=True)
avocado_df.truncate('2017-01-01', '2018-02-01')

            AveragePrice  Total Volume          type         region
Date
2017-01-01          1.23      66616.54       organic   SouthCentral
2017-01-01          1.34      36915.87       organic        Chicago
2017-01-01          1.06      15669.84       organic  DallasFtWorth
2017-01-01          1.43      49777.56       organic      Southeast
2017-01-01          1.51       3969.98       organic        Roanoke
...                  ...           ...           ...            ...
2018-01-28          1.70       4300.76       organic        Spokane
2018-01-28          1.20    2278728.69  conventional        NewYork
2018-01-28          1.43       7669.31       organic       Columbus
2018-01-28          1.34     486679.98  conventional       Portland
2018-01-28          1.34     548587.07  conventional        Seattle

[6154 rows x 4 columns]

In [52]:
# you can offset (shift) all dates by days or month as follows
avocado_df.index = avocado_df.index + pd.DateOffset(months=12, days=30)

In [53]:
avocado_df

            AveragePrice  Total Volume          type              region
Date
2016-02-03          1.75      27365.89       organic           Southeast
2016-02-03          1.49      17723.17       organic             Chicago
2016-02-03          1.68       2896.72       organic  HarrisburgScranton
2016-02-03          1.52      54956.80  conventional          Pittsburgh
2016-02-03          1.64       1505.12       organic               Boise
...                  ...           ...           ...                 ...
2019-04-24          1.36     908202.13  conventional             Chicago
2019-04-24          0.70    9010588.32  conventional        SouthCentral
2019-04-24          1.42     163496.70       organic        SouthCentral
2019-04-24          1.70     190257.38       organic          California
2019-04-24          1.34    1774776.77  conventional             NewYork

[18249 rows x 4 columns]

In [55]:
# Let's revert back to the original dataset!
avocado_df.index = avocado_df.index - pd.DateOffset(months=12, days=30)
avocado_df

            AveragePrice  Total Volume          type              region
Date
2015-01-29          1.75      27365.89       organic           Southeast
2015-01-29          1.49      17723.17       organic             Chicago
2015-01-29          1.68       2896.72       organic  HarrisburgScranton
2015-01-29          1.52      54956.80  conventional          Pittsburgh
2015-01-29          1.64       1505.12       organic               Boise
...                  ...           ...           ...                 ...
2018-03-31          1.36     908202.13  conventional             Chicago
2018-03-31          0.70    9010588.32  conventional        SouthCentral
2018-03-31          1.42     163496.70       organic        SouthCentral
2018-03-31          1.70     190257.38       organic          California
2018-03-31          1.34    1774776.77  conventional             NewYork

[18249 rows x 4 columns]

In [56]:
# Once you have the index set to DateTime, this unlocks its power by performing aggregation
# Aggregating the data by year (A = annual)
avocado_df.resample(rule='A').mean()

/var/folders/7w/96n4332d1k95m5_ly0gmyjw00000gn/T/ipykernel_72216/4166377095.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avocado_df.resample(rule='A').mean()

            AveragePrice  Total Volume
Date
2015-12-31      1.375590  7.810274e+05
2016-12-31      1.337470  8.604714e+05
2017-12-31      1.519715  8.603237e+05
2018-12-31      1.347531  1.066928e+06

In [57]:
# Aggregating the data by month (M = Month)
avocado_df.resample(rule='M').mean()

/var/folders/7w/96n4332d1k95m5_ly0gmyjw00000gn/T/ipykernel_72216/343604737.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avocado_df.resample(rule='M').mean()

            AveragePrice  Total Volume
Date
2015-01-31      1.365046  7.363084e+05
2015-02-28      1.323759  8.371712e+05
2015-03-31      1.374722  7.619172e+05
2015-04-30      1.383449  7.966305e+05
2015-05-31      1.344685  8.958964e+05
2015-06-30      1.399074  8.838582e+05
2015-07-31      1.409444  8.256988e+05
2015-08-31      1.444481  7.763793e+05
2015-09-30      1.449144  7.620806e+05
2015-10-31      1.391968  7.078151e+05
2015-11-30      1.330611  6.841482e+05
2015-12-31      1.305244  6.868351e+05
2016-01-31      1.236991  8.828596e+05
2016-02-29      1.240278  9.678819e+05
2016-03-31      1.224213  9.055843e+05
2016-04-30      1.196759  9.613253e+05
2016-05-31      1.208727  1.027657e+06
2016-06-30      1.283056  9.498337e+05
2016-07-31      1.401333  8.653247e+05
2016-08-31      1.411111  8.583263e+05
2016-09-30      1.427870  8.386650e+05
2016-10-31      1.557093  6.670404e+05
2016-11-30      1.550023  6.023364e+05
2016-12-31      1.308130  8.072153e+05
2017-01-31      1.277708  9.927883e+05
2017-02-28      1.214792  1.091359e+06
2017-03-31      1.398935  8.307949e+05
2017-04-30      1.502611  9.070639e+05
2017-05-31      1.532593  9.854874e+05
2017-06-30      1.545395  9.544434e+05
2017-07-31      1.564926  8.794513e+05
2017-08-31      1.698958  7.831782e+05
2017-09-30      1.847019  6.535111e+05
2017-10-31      1.722731  6.820868e+05
2017-11-30      1.517292  7.512021e+05
2017-12-31      1.363852  8.506164e+05
2018-01-31      1.387431  9.946923e+05
2018-02-28      1.318704  1.152264e+06
2018-03-31      1.336458  1.053827e+06

In [58]:
# You can obtain the maximum value for each Quarter end as follows: 
avocado_df.resample(rule='Q').max()

            AveragePrice  Total Volume     type            region
Date
2015-03-31          2.38   44655461.51  organic  WestTexNewMexico
2015-06-30          2.40   41291704.39  organic  WestTexNewMexico
2015-09-30          2.79   37943670.34  organic  WestTexNewMexico
2015-12-31          2.79   31047484.27  organic  WestTexNewMexico
2016-03-31          2.38   52288697.89  organic  WestTexNewMexico
2016-06-30          2.40   46324529.70  organic  WestTexNewMexico
2016-09-30          2.91   39993186.04  organic  WestTexNewMexico
2016-12-31          3.25   38879716.85  organic  WestTexNewMexico
2017-03-31          3.05   61034457.10  organic  WestTexNewMexico
2017-06-30          3.17   47293921.60  organic  WestTexNewMexico
2017-09-30          3.04   39367336.18  organic  WestTexNewMexico
2017-12-31          2.87   38267341.61  organic  WestTexNewMexico
2018-03-31          2.30   62505646.52  organic  WestTexNewMexico

In [59]:
# You can locate the rows that satisfies a given critirea as follows: 
low_price = avocado_df['AveragePrice'].where(avocado_df['AveragePrice']<1.2)
low_price

Date
2015-01-29    NaN
2015-01-29    NaN
2015-01-29    NaN
2015-01-29    NaN
2015-01-29    NaN
             ...
2018-03-31    NaN
2018-03-31    0.7
2018-03-31    NaN
2018-03-31    NaN
2018-03-31    NaN
Name: AveragePrice, Length: 18249, dtype: float64

In [60]:
low_price = avocado_df['AveragePrice'].where(avocado_df['AveragePrice']<1.3).resample('1M').count()
low_price

Date
2015-01-31    224
2015-02-28    282
2015-03-31    209
2015-04-30    198
2015-05-31    271
2015-06-30    201
2015-07-31    224
2015-08-31    254
2015-09-30    202
2015-10-31    217
2015-11-30    284
2015-12-31    226
2016-01-31    240
2016-02-29    314
2016-03-31    270
2016-04-30    345
2016-05-31    261
2016-06-30    240
2016-07-31    248
2016-08-31    185
2016-09-30    175
2016-10-31    155
2016-11-30    109
2016-12-31    293
2017-01-31    246
2017-02-28    269
2017-03-31    180
2017-04-30    187
2017-05-31    135
2017-06-30    140
2017-07-31    124
2017-08-31     55
2017-09-30     23
2017-10-31     39
2017-11-30    117
2017-12-31    232
2018-01-31    177
2018-02-28    189
2018-03-31    196
Freq: M, Name: AveragePrice, dtype: int64

In [61]:
# You can create new features from the date time information as follows
avocado_df

            AveragePrice  Total Volume          type              region
Date
2015-01-29          1.75      27365.89       organic           Southeast
2015-01-29          1.49      17723.17       organic             Chicago
2015-01-29          1.68       2896.72       organic  HarrisburgScranton
2015-01-29          1.52      54956.80  conventional          Pittsburgh
2015-01-29          1.64       1505.12       organic               Boise
...                  ...           ...           ...                 ...
2018-03-31          1.36     908202.13  conventional             Chicago
2018-03-31          0.70    9010588.32  conventional        SouthCentral
2018-03-31          1.42     163496.70       organic        SouthCentral
2018-03-31          1.70     190257.38       organic          California
2018-03-31          1.34    1774776.77  conventional             NewYork

[18249 rows x 4 columns]

In [62]:
avocado_df.reset_index(inplace=True)
avocado_df

            Date  AveragePrice  Total Volume          type              region
0     2015-01-29          1.75      27365.89       organic           Southeast
1     2015-01-29          1.49      17723.17       organic             Chicago
2     2015-01-29          1.68       2896.72       organic  HarrisburgScranton
3     2015-01-29          1.52      54956.80  conventional          Pittsburgh
4     2015-01-29          1.64       1505.12       organic               Boise
...          ...           ...           ...           ...                 ...
18244 2018-03-31          1.36     908202.13  conventional             Chicago
18245 2018-03-31          0.70    9010588.32  conventional        SouthCentral
18246 2018-03-31          1.42     163496.70       organic        SouthCentral
18247 2018-03-31          1.70     190257.38       organic          California
18248 2018-03-31          1.34    1774776.77  conventional             NewYork

[18249 rows x 5 columns]

In [63]:
avocado_df['day'] = avocado_df['Date'].dt.day
avocado_df

,Date,AveragePrice,Total Volume,type,region,day
0,2015-01-29,1.75,27365.89,organic,Southeast,29
1,2015-01-29,1.49,17723.17,organic,Chicago,29
2,2015-01-29,1.68,2896.72,organic,HarrisburgScranton,29
3,2015-01-29,1.52,54956.80,conventional,Pittsburgh,29
4,2015-01-29,1.64,1505.12,organic,Boise,29
...,...,...,...,...,...,...
18244,2018-03-31,1.36,908202.13,conventional,Chicago,31
18245,2018-03-31,0.70,9010588.32,conventional,SouthCentral,31
18246,2018-03-31,1.42,163496.70,organic,SouthCentral,31
18247,2018-03-31,1.70,190257.38,organic,California,31
18248,2018-03-31,1.34,1774776.77,conventional,NewYork,31

In [64]:
avocado_df['Month'] = avocado_df['Date'].dt.month
avocado_df

,Date,AveragePrice,Total Volume,type,region,day,Month
0,2015-01-29,1.75,27365.89,organic,Southeast,29,1
1,2015-01-29,1.49,17723.17,organic,Chicago,29,1
2,2015-01-29,1.68,2896.72,organic,HarrisburgScranton,29,1
3,2015-01-29,1.52,54956.80,conventional,Pittsburgh,29,1
4,2015-01-29,1.64,1505.12,organic,Boise,29,1
...,...,...,...,...,...,...,...
18244,2018-03-31,1.36,908202.13,conventional,Chicago,31,3
18245,2018-03-31,0.70,9010588.32,conventional,SouthCentral,31,3
18246,2018-03-31,1.42,163496.70,organic,SouthCentral,31,3
18247,2018-03-31,1.70,190257.38,organic,California,31,3
18248,2018-03-31,1.34,1774776.77,conventional,NewYork,31,3

In [65]:
avocado_df['Year'] = avocado_df['Date'].dt.year
avocado_df

,Date,AveragePrice,Total Volume,type,region,day,Month,Year
0,2015-01-29,1.75,27365.89,organic,Southeast,29,1,2015
1,2015-01-29,1.49,17723.17,organic,Chicago,29,1,2015
2,2015-01-29,1.68,2896.72,organic,HarrisburgScranton,29,1,2015
3,2015-01-29,1.52,54956.80,conventional,Pittsburgh,29,1,2015
4,2015-01-29,1.64,1505.12,organic,Boise,29,1,2015
...,...,...,...,...,...,...,...,...
18244,2018-03-31,1.36,908202.13,conventional,Chicago,31,3,2018
18245,2018-03-31,0.70,9010588.32,conventional,SouthCentral,31,3,2018
18246,2018-03-31,1.42,163496.70,organic,SouthCentral,31,3,2018
18247,2018-03-31,1.70,190257.38,organic,California,31,3,2018
18248,2018-03-31,1.34,1774776.77,conventional,NewYork,31,3,2018

In [66]:
# Don't forget to set the Date to be in the index for the DataFrame
avocado_df.set_index(keys=['Date'], inplace=True)
avocado_df

,AveragePrice,Total Volume,type,region,day,Month,Year
Date,,,,,,,
2015-01-29,1.75,27365.89,organic,Southeast,29,1,2015
2015-01-29,1.49,17723.17,organic,Chicago,29,1,2015
2015-01-29,1.68,2896.72,organic,HarrisburgScranton,29,1,2015
2015-01-29,1.52,54956.80,conventional,Pittsburgh,29,1,2015
2015-01-29,1.64,1505.12,organic,Boise,29,1,2015
...,...,...,...,...,...,...,...
2018-03-31,1.36,908202.13,conventional,Chicago,31,3,2018
2018-03-31,0.70,9010588.32,conventional,SouthCentral,31,3,2018
2018-03-31,1.42,163496.70,organic,SouthCentral,31,3,2018
2018-03-31,1.70,190257.38,organic,California,31,3,2018
2018-03-31,1.34,1774776.77,conventional,NewYork,31,3,2018

**MINI CHALLENGE #4:**
- **Calculate the average avocado price per quarter end**

In [67]:
avocado_df.resample(rule='Q').mean()

/var/folders/7w/96n4332d1k95m5_ly0gmyjw00000gn/T/ipykernel_72216/4000384498.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avocado_df.resample(rule='Q').mean()

            AveragePrice  Total Volume        day      Month    Year
Date
2015-03-31      1.352144  7.829814e+05  29.230769   2.000000  2015.0
2015-06-30      1.373348  8.616490e+05  30.384615   5.000000  2015.0
2015-09-30      1.435135  7.871549e+05  30.692308   8.000000  2015.0
2015-12-31      1.341711  6.922609e+05  30.615110  10.999287  2015.0
2016-03-31      1.234323  9.225527e+05  29.923077   2.000000  2016.0
2016-06-30      1.226994  9.781990e+05  30.307692   4.923077  2016.0
2016-09-30      1.412507  8.549684e+05  30.692308   7.923077  2016.0
2016-12-31      1.466157  6.986160e+05  30.714286  11.000000  2016.0
2017-03-31      1.297145  9.716475e+05  29.333333   2.000000  2017.0
2017-06-30      1.524971  9.457601e+05  30.308131   4.921541  2017.0
2017-09-30      1.703968  7.712518e+05  30.642857   8.000000  2017.0
2017-12-31      1.521489  7.681721e+05  30.692308  11.076923  2017.0
2018-03-31      1.347531  1.066928e+06  29.333333   2.000000  2018.0

# 5. DATA PLOTTING (STRETCH ASSIGNMENT!)

In [ ]:
# Once you have index set to DateTime, this unlocks its power by performing aggregation
# Aggregating the data by month end

In [ ]:
# plot the avocado average price per month

In [ ]:
# plot the avocado average price per quarter

In [ ]:
# plot the avocado average price per annual basis

In [ ]:


plt.figure(figsize = (10, 7))
sns.violinplot(y = 'AveragePrice', x = 'type', data = avocado_df)

In [ ]:
# plot the distribution plot of avocado prices (histogram + Kernel Denisty Estimate)

In [ ]:
# Catplot is used to draw categorical plots onto a FacetGrid.
# Catplot provides access to several axes-level functions that show the relationship between a numerical and one or more categorical variables.

**MINI CHALLENGE #5:**
- **Plot the average price of avocado on a weekly basis**
- **Plot Catplot for price vs. region for organic food**